# LinkElementId Operators

---
The LinkElementId type exposes the following members.
| Name| Description
---|---|---
| Equality(LinkElementId, LinkElementId)| Determines whether these two LinkElementIds are the same.
| Inequality(LinkElementId, LinkElementId)| Determines whether these two LinkElementIds are different.
Top
#### Reference
LinkElementId Class
Autodesk.Revit.DB Namespace